# GetFormatOptions Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleField..::..GetFormatOptions Method
ScheduleField Class See Also
---
Gets the FormatOptions to optionally override the default settings in the Units class.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public FormatOptions GetFormatOptions()
```

Visual Basic
---
```text
Public Function GetFormatOptions As FormatOptions
```

Visual C++
---
```text
public:
FormatOptions^ GetFormatOptions()
```

# ### Return Value
A copy of the FormatOptions.
# See Also
ScheduleField Class
Autodesk.Revit.DB Namespace